* Part 1

http://adventofcode.com/2016/day/5

#+BEGIN_SRC q
p2 : { [f;g; tuple] (f tuple 0; g tuple 1)} 
fork: { (x;x)}
" | a | b | "
#+END_SRC

#+RESULTS:
: " | a | b | "


|        | 0x000004                                                          |
|--------+-------------------------------------------------------------------|
|        | fork                                                              |
|        | =>(0x000004;0x000004)                                             |
|        | p2[2#; {x[2]}]                                                    |
|        | =>(0x0000;0x04)                                                   |
|        | p2[0x0000 =; 0x10>]                                               |
|        | =>(11b;1b)                                                        |
|        | p2[(and/); ::]                                                    |
|        | =>11b                                                             |
|        | .[and]                                                            |
|        | =>1b                                                              |
|--------+-------------------------------------------------------------------|
| five0: | {.[and] p2[(and/); ::] p2[0x0000 =; 0x10>] p2[2#; {x[2]}] fork x} |
#+TBLFM: $2='(step2 @# @0 @-1 @1)::@>$2='(qq (qf2 $-1 @2$2..@-1$2))


|       | 11000000                                                                                 |
|-------+------------------------------------------------------------------------------------------|
|       | til                                                                                      |
|       | =>0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 ..        |
|       | string                                                                                   |
|       | =>(,"0";,"1";,"2";,"3";,"4";,"5";,"6";,"7";,"8";,"9";"10";"11";"12";"13";"14";"..        |
|       | "ojvtpuvg" ,/:                                                                           |
|       | =>("ojvtpuvg0";"ojvtpuvg1";"ojvtpuvg2";"ojvtpuvg3";"ojvtpuvg4";"ojvtpuvg5";"ojv..        |
|       | md5 each                                                                                 |
|       | =>(0x2fb4adfb908f0b9dc19ef1a493b6f135;0xc574623eb59fd9f0882e2f5762c855c1;0x412e..        |
|       | (3#) each                                                                                |
|       | =>(0x2fb4ad;0xc57462;0x412e8c;0xa5a155;0x7f2139;0xe321c2;0x0de2b2;0x5342de;0xa7..        |
|       | {x  where five0 each x}                                                                  |
|       | =>(0x000004;0x000005;0x000004;0x000003;0x00000c;0x000001;0x000005;0x000004)              |
|       | 2 _/:                                                                                    |
|       | =>(,0x04;,0x05;,0x04;,0x03;,0x0c;,0x01;,0x05;,0x04)                                      |
|-------+------------------------------------------------------------------------------------------|
| top5: | top5: 0N! {2 _/: {x  where five0 each x} (3#) each md5 each "ojvtpuvg" ,/: string til x} |
#+TBLFM: $2='(step2 @# @0 @-1 @1)::@>$2='(identity (qf2 $-1 @2$2..@-1$2))

* Part 2
